brew "git"
brew "openssl@3"
brew "readline"
brew "libffi"
brew "libyaml"

brew "rbenv"
brew "ruby-build"

brew "nvm"
brew "yarn"

brew "postgresql"
brew "redis"

brew "tree"

# --- Casks ---
cask "google-chrome"
cask "firefox"

cask "iterm2"
cask "visual-studio-code"
cask "dash"

cask "slack"
cask "zoom"

cask "docker"

cask "rectangle"
cask "tableplus"

# cask "logi-options-plus"

# cask "1password"   # optional – uncomment if needed
