cask_args appdir: '/Applications'

tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "thoughtbot/formulae"

# Tool for generating GNU Standards-compliant Makefiles
brew "automake"

# Parser generator
brew "bison"

# Ruby environment tool
brew "chruby"

# GNU database manager
brew "gdbm"

# Distributed revision control system
brew "git"

# Everything you need to get started with Heroku
brew "heroku/brew/heroku"

# Portable Foreign Function Interface library
brew "libffi"

# YAML Parser
brew "libyaml"

# Open source relational database management system
brew "mysql@5.7"

# Manage multiple Node.js versions
brew "nvm"

# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"

# Object-relational database system
brew "postgresql", restart_service: true

# Library for command-line editing
brew "readline"

# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true

# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"

# Shell commands for environment parity for Heroku apps
brew "thoughtbot/formulae/parity"

# Display directories as trees (with optional color/HTML output)
brew "tree"

# JavaScript package manager
brew "yarn"

# Application launcher and productivity software
#cask "alfred"

# Memory training application
#cask "anki"

# UI wireframing tool
#cask "balsamiq-wireframes"

# Menu bar icon organizer
#cask "bartender"

# Visual communication platform
#cask "cloudapp"

# API documentation browser and code snippet manager
#cask "dash"

# VPN client for secure internet access and private browsing
#cask "expressvpn"

# Web browser
cask "firefox"

# Free and open-source image editor
#cask "gimp"

# Back up and sync files with Google Drive
#cask "google-backup-and-sync"

# Google Chat replaces Google Hangouts
#cask "google-chat"

# Web browser
cask "google-chrome"

# Google Photos Backup And Sync
#cask "google-photos-backup-and-sync"

# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"

# Spot and merge differences in text and image files or folders
cask "kaleidoscope"

# Interface for reading and syncing eBooks
#cask "kindle"

# Visual user interface for Docker Container management
cask "kitematic"

# Password manager
cask "lastpass"

# Open-source Markdown editor
cask "macdown"

# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"

# Administration and development platform for PostgreSQL
cask "pgadmin4"

# Collaboration platform for API development
cask "postman"

# Peer to peer Bitorrent client
#cask "qbittorrent"

# MongoDB management tool
#cask "robo-3t"

# Video chat, voice call and instant messaging application
cask "skype"

# Team communication and collaboration software
cask "slack"

# Move and resize windows with ease
cask "spectacle"

# Text editor for code, markup and prose
cask "sublime-text"

# Open-source code editor
cask "visual-studio-code"

# Multimedia player
#cask "vlc"
